#include <bits/stdc++.h>
using namespace std;
/*
 * ###继承###
 * 
 * 特点：不会改变基类中的所有变狼和函数，还可以增加新的数据成员和函数
 * 
 * 保护成员：子类不可以方位基类的私有成员，但是可以访问基类中的保护成员
 * 
 * 继承的分类
 * private：基类的保护和公有成员变成子类的私有成员
 * ptotected：保护成员和共有成员变成子类中的保护成员
 * public：保护成员和共有成员变成了子类中的共有成员
 * 如果省略了继承修饰符，那么默认是私有继承
 * 
 * ###继承下的构造函数和析构函数###
 * 
 * 当子类和基类都有构造函数的时候，如果定义一个子类对象，那么首先要调用基类的构造函数，然后再调用子类的构造函数
 * 析构函数则相反
 * 
 * 向父类的构造函数传参数
 * 如果基类的构造函数带有参数，那么必须让子类的构造函数显示调用基类的构造函数，并且向基类的构造函数传递参数
 * 
 * ###初始化列表的作用###
 * 
 * 类中的const常量只能再初始化列表里面进行初始化，而不能再函数体内用赋值的方式来初始化
 * 对象类型成员的初始化放在初始化列表中，则效率较高，反之较低。基本类型标量的初始化可以再初始化列表中，也可以再构造函数中，效率上没有区别
 * 
 * ###覆盖基类的函数成员###
 * 
 * 覆盖和重载的区别
 * 覆盖是一定出现在具有继承关系的基类和子类之间，要求函数名，参数个数和类型都完全相同
 * 
**/